of40/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

nH 10;
nB 60; rB 30;

//aux
nH2 #calc "2.*$nH";
nH44 #calc "44.*$nH";
irB #calc "1./$rB";
nX #calc "16.*$nH";

vertices
(
   (-1400 0 0) //0
   (-150 0 0)
   (-100 0 0) //2
   (-50 0 0)
   (0 0 0) //4
   (1100 0 0)
   (1500 0 0) //6
   (1900 0 0)
   (2300 0 0) //8
   (3000 0 0)
   (3000 50 0) //10
   (2300 50 0)
   (1900 500 0) //12
   (1500 500 0)
   (1100 25 0) //14 
   (0 25 0)
   (0 75 0 ) //16
   (25 125 0)
   (25 1375 0) //18
   (-75 1375 0)
   (-75 125 0) //20
   (-50 75 0)
   (-50 25 0) //22
   (-100 25 0)
   (-150 50 0) //24
   (-1400 50 0)
   
   (-1400 0 10) //0
   (-150 0 10)
   (-100 0 10) //2
   (-50 0 10)
   (0 0 10) //4
   (1100 0 10)
   (1500 0 10) //6
   (1900 0 10)
   (2300 0 10) //8
   (3000 0 10)
   (3000 50 10) //10
   (2300 50 10)
   (1900 500 10) //12
   (1500 500 10)
   (1100 25 10) //14 
   (0 25 10)
   (0 75 10 ) //16
   (25 125 10)
   (25 1375 10) //18
   (-75 1375 10)
   (-75 125 10) //20
   (-50 75 10)
   (-50 25 10) //22
   (-100 25 10)
   (-150 50 10) //24
   (-1400 50 10)
);

blocks
(
    hex (0 1 24 25 26 27 50 51) ($nB $nH 1) simpleGrading ($irB 1 1) //0
    hex (1 2 23 24 27 28 49 50) ($nH2 $nH 1) simpleGrading (1 1 1) //1
    hex (2 3 22 23 28 29 48 49) ($nH2 $nH 1) simpleGrading (1 1 1) //2
    hex (3 4 15 22 29 30 41 48) ($nH2 $nH 1) simpleGrading (1 1 1) //3
    hex (22 15 16 21 48 41 42 47) ($nH2 $nH2 1) simpleGrading (1 1 1) //4
    hex (21 16 17 20 47 42 43 46) ($nH2 $nH2 1) simpleGrading (1 1 1) //5
    hex (20 17 18 19 46 43 44 45) ($nH2 $nB 1) simpleGrading (1 $rB 1) //6
    hex (4 5 14 15 30 31 40 41) ($nH44 $nH 1) simpleGrading (1 1 1) //7  
    hex (5 6 13 14 31 32 39 40) ($nX $nH 1) simpleGrading (1 1 1) //8 
    hex (6 7 12 13 32 33 38 39) ($nX $nH 1) simpleGrading (1 1 1) //9
    hex (7 8 11 12 33 34 37 38) ($nX $nH 1) simpleGrading (1 1 1) //10 
    hex (8 9 10 11 34 35 36 37) (50 $nH 1) simpleGrading (12 1 1) //11
);

edges
(
);

boundary
(

     inletWest
     {
      type patch;
      faces
      (
            (0 25 51 26)           
      );
    }
    
     inletNorth
     {
      type patch;
      faces
      (
            (19 18 44 45)           
      );
    }
    
    walls
    {
        type wall;
        faces
        (
            (25 24 50 51)
            (24 23 49 50)
            (23 22 48 49)
            (22 21 47 48)
            (21 20 46 47)
            (20 19 45 46)
            (17 18 44 43)
            (16 17 43 42)
            (15 16 42 41)
            (15 14 40 41)
            (14 13 39 40)
            (13 12 38 39)
            (12 11 37 38)
            (11 10 36 37)      
        );
    }
    
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 27 26)
            (1 2 28 27)
            (2 3 29 28)
            (3 4 30 29)
            (4 5 31 30)
            (5 6 32 31)
            (6 7 33 32)
            (7 8 34 33)
            (8 9 35 34)     
        );
    }
    
    outlet
    {
       type patch;
        faces
        (
            (9 10 36 35)        
        );
    }      
);

mergePatchPairs
(
);

// ************************************************************************* //
